Revit 2027 API
BoundaryConditions.HostElementId Property
 The host element Id for the boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HostElementId { get; }
Public ReadOnly Property HostElementId As ElementId
	Get
public:
property ElementId^ HostElementId {
	ElementId^ get ();
}
member HostElementId : ElementId with get
Property Value
ElementId
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace